app/Controllers/Etalase.php

SELECT *
FROM `barang`
---
    public function index()
    {
        $barang = new \App\Models\BarangModel();
        $model = $barang->findAll();

SELECT *
FROM `barang`
WHERE `barang`.`id` = '13'
UPDATE `barang` SET `stok` = 999
WHERE `barang`.`id` IN ('13')
---
    public function beli()
    {
        $id = $this->request->uri->getSegment(3);

        $modelBarang = new \App\Models\BarangModel();

        $model = $modelBarang->find($id);

        $provinsi = $this->rajaongkir('province');

        if ($this->request->getPost()) {
            $data = $this->request->getPost();
            $this->validation->run($data, 'transaksi');
            $errors = $this->validation->getErrors();

            if (!$errors) {
                $transaksiModel = new \App\Models\TransaksiModel();
                $transaksi = new \App\Entities\Transaksi();

                $barangModel = new \App\Models\BarangModel();
                $id_barang = $this->request->getPost('id_barang');
                $jumlah_pembelian = $this->request->getPost('jumlah');

                $barang = $barangModel->find($id_barang);
                $entityBarang = new \App\Entities\Barang();

                $entityBarang->id = $id_barang;

                $entityBarang->stok = $barang->stok - $jumlah_pembelian;
                $barangModel->save($entityBarang);

INSERT INTO `transaksi` (`id_barang`, `id_pembeli`, `jumlah`, `ongkir`, `alamat`, `total_harga`, `status`, `created_by`, `created_date`) VALUES ('13', '15', '1', '10000', 'jakarta utara 17', '14999', 0, '15', '2024-05-11 15:56:42')
---
                $transaksi->created_by = $this->session->get('id');
                $transaksi->created_date = date("Y-m-d H:i:s");

                $transaksiModel->save($transaksi);